## <span style="color:orange">Techniques: </span>
- Decision tree
- Random Forest tree
- Gaussian Naive Bayes
- Logistic Regression

### <span style="color:purple">Dataset: Titanic_Survived Prediction !</span>

### <span style="color:red">Problem: Classification</span>

### <span style="color:cyan">Step: 01</span>: (Import Dataset)

In [1]:
# import libraries !

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import MinMaxScaler

In [2]:
# import Dataset !

df = pd.read_csv('titanic.csv')
df.head()

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
df.shape

(891, 16)

### Missing Values

In [4]:
for feature in df:
    if df[feature].isnull().sum()>1:
        print(feature,":", np.round(df[feature].isnull().mean(),4),'%')
    
else:
     print("There is no Null Values")

age : 0.1987 %
embarked : 0.0022 %
deck : 0.7722 %
embark_town : 0.0022 %
There is no Null Values

In [5]:
df.isnull().sum()

Unnamed: 0       0
survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [6]:
df = df.drop(['Unnamed: 0', 'deck'], axis=1)
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True

In [12]:
df['age'] = df['age'].replace(np.nan, df.age.mean())
df['age']

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: age, Length: 889, dtype: float64

### Categorical feature

In [7]:
categorical_feature = ['sex', 'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive', 'alone']
df[categorical_feature].head()

      sex embarked  class    who  adult_male  embark_town alive  alone
0    male        S  Third    man        True  Southampton    no  False
1  female        C  First  woman       False    Cherbourg   yes  False
2  female        S  Third  woman       False  Southampton   yes   True
3  female        S  First  woman       False  Southampton   yes  False
4    male        S  Third    man        True  Southampton    no   True

In [13]:
df = df.dropna()

In [14]:
df.shape

(889, 14)

In [11]:
le = LabelEncoder()

cat_feature = [i for i in df[categorical_feature]]

df[cat_feature] = le.fit_transform(df[cat_feature])






# # import encodeing library !
# from sklearn.preprocessing import LabelEncoder

# le = LabelEncoder()
# df['Company_Name'] = le.fit_transform(df['Company_Name'])





# # transformation !
# from sklearn.preprocessing import MinMaxScaler

# feature = [i for i in df.columns if i not in ['ESG Score', 'Year']]
# # feature = X.columns
# scaling = MinMaxScaler()
# # df[feature] = scaling.fit_transform(df[feature])

ValueError: y should be a 1d array, got an array of shape (889, 8) instead.